Revit 2026 API

# SolidUtilsSplitVolumes Method

---

Splits a solid geometry into several separate solids.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<Solid> SplitVolumes(
	Solid solid
)
```
```vb
Public Shared Function SplitVolumes (
	solid As Solid
) As IList(Of Solid)
```
```cpp
public:
static IList<Solid^>^ SplitVolumes(
	Solid^ solid
)
```
```fsharp
static member SplitVolumes :
        solid : Solid -> IList<Solid>
```

#### Parameters

solid Solid
     The solid.

#### Return Value

IListSolid The split solid geometries.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Failed to split the solid geometry. |

If no splitting is done, a copy of the input solid will be returned in the output array.

#### Reference

SolidUtils Class

Autodesk.Revit.DB Namespace